app/views/surveys/_answer_question_form.html.erb

SELECT "question_options".* FROM "question_options" WHERE "question_options"."question_id" = ?  [["question_id", 1]]
---
      <%# Get question options %>
      <% questionOptions = QuestionOption.where(:question_id => question) %>