app/controllers/surveys_controller.rb

SELECT "surveys".* FROM "surveys" WHERE "surveys"."user_id" = ?  [["user_id", 1]]
SELECT "surveys".* FROM "surveys" WHERE "surveys"."public" = ?  [["public", 1]]
---
  def index
    if params['drafts'] == 'true' then
      puts 'showing surveys belonging to current user'
      @surveys = Survey.where(:user_id => current_user)
    else
      puts 'showing all public surveys'
      @surveys = Survey.where(:public => true)

INSERT INTO "surveys" ("public", "creationDate", "expiryDate", "created_at", "updated_at", "user_id", "survey_name") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @survey = Survey.new(survey_params)

    respond_to do |format|
      if @survey.save

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_survey
      @survey = Survey.find(params[:id])