app/controllers/twitter_sessions_controller.rb

  def create
    @user = TwitterUser.where(uid: auth_hash[:uid], provider: auth_hash[:provider]).first_or_create
---
SELECT  "twitter_users".* FROM "twitter_users" WHERE "twitter_users"."uid" = ? AND "twitter_users"."provider" = ? ORDER BY "twitter_users"."id" ASC LIMIT ?  [["uid", "2557051825"], ["provider", "twitter"], ["LIMIT", 1]]